step-by-step/030-populate-database/020-soap/0800-справочник-типов-сервисов/0100.xml

<?xml version="1.0" ?>
<!-- Создаем тип сервиса -->
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header>
        <auth xmlns="http://ws.base.kernel.bgbilling.bitel.ru/" pswd="admin" user="admin"></auth>
    </S:Header>
    <S:Body>
        <ns5:inetServTypeUpdate xmlns:common="http://common.bitel.ru"
                                xmlns:ns5="http://service.common.api.inet.modules.bgbilling.bitel.ru/"
                                xmlns:xs="http://www.w3.org/2001/XMLSchema"
                                xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <inetServType xmlns="" addressAllInterface="false" addressType="5" deviceGroupIds="3" deviceTypeIds=""
                          id="0" needContractObject="false" needDevice="true" needIdentifier="false"
                          needInterface="true" needLogin="false" needMacAddress="false" needRestriction="false"
                          needVlan="true" parentTypeIds="" personalInterface="true" personalVlan="true"
                          sessionCountLimit="1" sessionCountLimitLock="false" sessionInitiationType="0" title="DHCP"
                          trafficTypeLinkId="0">
                <config>title.pattern=DHCP (${deviceIdentifier}):(${interfaceId})</config>
                <ipFromParentRange>false</ipFromParentRange>
            </inetServType>
        </ns5:inetServTypeUpdate>
    </S:Body>
</S:Envelope>
